# Homebrew taps
tap "koekeishiya/formulae"

# Homebrew packages
brew "angular-cli"
brew "just"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "neovim"
brew "node"
brew "python@3.12"
brew "mas"  # Mac App Store CLI

# Homebrew casks
cask "asana"
cask "postman"
cask "cursor"
cask "cursor-cli"
cask "notion-calendar"
cask "notion"
cask "google-chrome"
cask "dotnet-sdk@8"
cask "zoom"
cask "spotify"
cask "pgadmin4"
cask "font-maple-mono-nf"
cask "font-opendyslexic"
cask "logitech-options"
cask "ngrok"
cask "obs"
cask "powershell"
cask "vlc"
cask "jetbrains-toolbox"
cask "betterdisplay"

# Mac App Store apps
mas "Word", id: 462054704
mas "Excel", id: 462058435
mas "Whatsapp-messanger", id: 310633997
mas "Slack-desktop", id: 803453959

